//;******************************************************************************
//;* Copyright (c) 1983-2014, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
// *++
//
// Module Name:
//
//   SecureBootMgrStrings.vfr
//
// Abstract:
//
//   String definitions for Secure Boot Manager Utility.
//
// Revision History:
//
// --*/

/=#

#langdef eng "English"
#langdef fra "Français"


#string STR_ADMINISTER_SECURE_BOOT_TITLE      #language eng  "Administer Secure Boot"
                                              #language fra  "Administer Secure Boot"
#string STR_SYSTEM_STATUS_BANNER              #language eng  "System Status:"
                                              #language fra  "System Status:"
#string STR_SB_NULL_STRING                    #language eng  " "
                                              #language fra  " "
#string STR_SECURE_BOOT_DATABASE              #language eng  "Secure Boot Database"
                                              #language fra  "Secure Boot Database"
#string STR_UNLOCKED                          #language eng  "Unlocked"
                                              #language fra  "Unlocked"
#string STR_INSTALLED_AND_LOCKED              #language eng  "Installed and Locked"
                                              #language fra  "Installed and Locked"
#string STR_SECURE_BOOT_STATUS                #language eng  "Secure Boot Status"
                                              #language fra  "Secure Boot Status"
#string STR_CUSTOM_SECURITY                   #language eng  "User Customized Security"
                                              #language fra  "User Customized Security"
#string STR_YES                               #language eng  "YES"
                                              #language fra  "YES"
#string STR_NO                                #language eng  "NO"
                                              #language fra  "NO"
#string STR_SB_OPTIONS_STRING                 #language eng  "Options:"
                                              #language fra  "Options:"
#string STR_ENROLL_HASH_STRING                #language eng  "Select a UEFI file as trusted for execution"
                                              #language fra  "Select a UEFI file as trusted for execution"
#string STR_ENROLL_HASH_HELP                  #language eng  "Add sepecific EFI image hash to allowed database."
                                              #language fra  "Add sepecific EFI image hash to allowed database."
#string STR_SECURE_BOOT_STRING                #language eng  "Enforce Secure Boot"
                                              #language fra  "Enforce Secure Boot"
#string STR_SECURE_BOOT_HELP                  #language eng  "Select Disable to Suspend enforcement of Secure Boot Checks."
                                              #language fra  "Select Disable to Suspend enforcement of Secure Boot Checks."
#string STR_CLEAR_SECURE_SETTINGS_STRING      #language eng  "Erase all Secure Boot Settings"
                                              #language eng  "Erase all Secure Boot Settings"
#string STR_CLEAR_SECURE_SETTINGS_HELP        #language eng  "Enable this option will erase all Secure Boot Settings. This action will clear four varialbes PK, KEK, db, and dbx."
                                              #language eng  "Enable this option will erase all Secure Boot Settings. This action will clear four varialbes PK, KEK, db, and dbx."
#string STR_FACTORY_SETTINGS_STRING           #language eng  "Restore Secure Boot to Factory Settings"
                                              #language eng  "Restore Secure Boot to Factory Settings"
#string STR_FACTORY_SETTINGS_HELP             #language eng  "Restore all of the Secure Boot Settings to default factory settings and enable Secure Boot."
                                              #language eng  "Restore all of the Secure Boot Settings to default factory settings and enable Secure Boot."
#string STR_BACKUP_SETTINGS_STRING            #language eng  "Restore Secure Boot to Backup Settings"
                                              #language eng  "Restore Secure Boot to Backup Settings"
#string STR_BACKUP_SETTINGS_HELP              #language eng  "Restore all of the secure boot Settings to backup factory settings and enable Secure Boot."
                                              #language eng  "Restore all of the secure boot Settings to backup factory settings and enable Secure Boot."
#string STR_SB_DISABLED_TEXT                  #language eng  "Disabled"
                                              #language fra  "Désactiver"
#string STR_SB_ENABLED_TEXT                   #language eng  "Enabled"
                                              #language fra  "Activer"
#string STR_OPERATION_FINISH_MESSAGE          #language eng  "Operation is completed. System will reset!!"
                                              #language fra  "Operation is completed. System will reset!!"
#string STR_FORMATE_INCORRECT_MESSAGE         #language eng  "This isn't a vaild EFI image. Please select another file!!"
                                              #language fra  "This isn't a vaild EFI image. Please select another file!!"
#string STR_ADD_HASH_MESSAGE                  #language eng  "Add this hash image to allowed database (db)"
                                              #language fra  "Add this hash image to allowed database (db)"
#string STR_EXIT_MENU_STRING                  #language eng  "Exit Discarding Change"
                                              #language fra  "Exit Discarding Change"
#string STR_SAVE_CHANGE_STRING                #language eng  "Exit saving changes"
                                              #language fra  "Exit saving changes"
#string STR_FILE_NOT_FOUND_MESSAGE            #language en-US  "Cannot find file!!"
                                              #language fr-FR  "Cannot find file!!"